###########################################################################################
##############                ΜΠΑΤΣΙΑΚΑ ΜΑΡΙΑ                            ##################
##############                 ΑΕΜ     757                               ##################
###########################################################################################

#Εργασία 1
########################################################3
#Κάτω από κάθε ερώτηση να τοποθετήσετε το κώδικα-απάντηση της αντίστοιχης ερώτησης
#Μπορείτε για κάθε απάντηση να χρησιμοποιήσετε οποιοδήποτε μοτίβο κώδικα έχετε διδαχθεί
#An den emfanizontai sosta ta ellinika epilegetai apo to menu tools->global options->code->saving->default code encoding->utf-8
#epeita epilegetai apply kleinete to arxeio kai to ksanaanoigete

#Να υπολογίσετε και να εμφανίσετε τις απαντήσεις για κάθε ένα από τα παρακάτω ερωτήματα

dim(DelayedFlights) #diastasi (grammes - sthles)

install.packages("DescTools")
library("DescTools")
Desc(DelayedFlights,plotit = T)
dl<-data.frame(DelayedFlights)

#οκ#Ερώτηση 1:να βρείτε (αν υπάρχουν) και να εμφανίσετε το πλήθος των κενών γραμμών σε κάθε στήλη του dataset
j<-1
a<-c()
for (i in 1:ncol(dl)) #τρέχει από το 1 ως το πλήθος στηλών ( 30 ) του dataset
{
a[j]=length(which(is.na(dl[[i]])))
   j<-j+1
}
a=matrix(a,30,1)
print(a)  
#ο πίνακας a δείχνει για κάθε στήλη, το πλήθος των κενών στοιχείων
#π.χ. στη στήλη 21(TaxiIn), υπάρχουν 7110 κενές γραμμές



#οκ#Ερώτηση 2:να υπολογίσετε και να εμφανίσετε ποια ημέρα σε ποιον μήνα σημειώθηκαν οι περισσότερες καθυστερήσεις πτήσεων

#προσοχη#
#ο πίνακας ArrDelay ειναι ο πίνακας με τη διαφορές (Πραγματικος - Προγραμματισμενος χρόνος άφιξης)
#όμως σε αρκετές γραμμές έχει λάθη
#Γι αυτό θα χρησιμοποιώ τη διαφορα: Πραγματικος - Προγραμματισμενος χρόνος άφιξης

#θα ελέγξουμε για κάθε μήνα πόσες καθυστερήσεις υπήρξαν την καθε ημερα
w<-matrix(0,ncol = 12,nrow = 31)
colnames(w)=c("Ιανουάριος","Φεβρουάριος","Μάρτιος","Απρίλιος","Μάϊος","Ιούνιος","Ιούλιος","Αύγουστος","Σεπτέμβριος","Οκτώβριος","Νοέμβριος","Δεκέμβριος")
View(w)
for(v in 1:12) 
{ k<-1
for(i in 1:31)
{ z<-c()
for(j in (min(which(dl[,"Month"]==v),na.rm=TRUE)):(max(sort(which(dl[,"Month"]==v),decreasing = TRUE),na.rm=TRUE)))
{   
  if(dl[,"DayofMonth"][j]==i)
    {
      z[j]<- dl[,"ArrTime"][j]-dl[,"CRSArrTime"][j]#αν πάρεις το ArrDelay θα βγάλεις λάθος αποτελέσμα 
       }
}
w[k,v]<-length(which(z>0))
k<-k+1
}
}
print(w)
#παρατηρουμε οτι ο πινακας w μαλλον ειναι ορθός αναλογως με τις ημερες καθε μηνα( αλλοτε 30,αλλοτε 31 και 29 ο φεβρουαρ)
#οποτε τωρα εχουμε για καθε ημερα του καθε μηνα το συνολικο αριθμο καθυστερησεων.
#τώρα θα βρούμε το μέγιστο κάθε μήνα
x<-matrix(0,nrow = 12,ncol = 2)
colnames(x)=c("max στοιχείο","Θέση/Ημέρα")
rownames(x)=c("Ιανουάριος","Φεβρουάριος","Μάρτιος","Απρίλιος","Μάϊος","Ιούνιος","Ιούλιος","Αύγουστος","Σεπτέμβριος","Οκτώβριος","Νοέμβριος","Δεκέμβριος")
for(j in 1:12)
{
  x[j,1]<-max(w[,j])
  x[j,2]<-which.max(w[,j])
}

which.max(x[,1])#Ιανουάριος
x[,2][1]  # 2
#Συνεπώς, στις 2 Ιανουαρίου σημειώθηκαν οι περισσότερες καθυστερήσεις πτήσεων, 9563 σε πληθος


#ok#Ερώτηση 3: να υπολογίσετε και να εμφανίσετε τον ημερήσιο μέσο όρο καθυστερήσεων για καθέναν από τους θερινούς μήνες του 2008


w<-matrix(0,ncol = 3,nrow = 31)
colnames(w)=c("Ιούνιος","Ιούλιος","Αύγουστος")
View(w)
for(v in 6:8)
{ k<-1
for(i in 1:31)
{ z<-c()
l<-1
for(j in (min(which(dl[,"Month"]==v),na.rm=TRUE)):(max(sort(which(dl[,"Month"]==v),decreasing = TRUE),na.rm=TRUE)))
{   
  if(is.na(dl[,"ArrDelay"][j]) && dl[,"DayofMonth"][j]==i )
  {
    z[j]<-NA
  }
  else if(dl[,"DayofMonth"][j]==i && dl[,"ArrDelay"][j]>0)
  {
    z[j]<- dl[,"ArrDelay"][j]
  }
}
if(v==6)
{ 
  w[k,1]<-mean(z,na.rm = TRUE)
  k<-k+1
}
else if (v==7)
{
   w[k,2]<-mean(z,na.rm = TRUE)
  k<-k+1
}
else if(v==8)
{
  w[k,3]<-mean(z,na.rm = TRUE)
  k<-k+1
}
else
{}
}
}
print(w)
#Στον πίνακα W φαίνονται οι μέσες τιμές των καθυστερησεων καθε ημέρας των θερινων μηνών.

#ok#Ερώτηση 4: να υπολογίσετε και να εμφανίσετε το όνομα της αεροπορικής εταιρίας που είχε το μεγαλύτερο πλήθος κωδικών ακύρωσης τύπου Β

Desc(dl[,"UniqueCarrier"]) 
k<-1
z<-c()
for(i in 1:nrow(dl))
{
  if (dl[,"CancellationCode"][i]=="B") 
  {
    z[k]<-dl[,"UniqueCarrier"][i]
    k<-k+1
  }
}
View(z) # Στον πίνακα z εμφανιζονται ολες οι αεροπορικες που εχουν CancellationCode =="B"
length(which(dl[,"CancellationCode"]=="B")) #βλεπουμε ποσοι κωδικοι ειναι τυπου Β. Άρα, length(z)=307 ειναι σωστο.
table(z) #υπολογίζει τη συχνότητα του περιεχομένου του z
#δηλ υπολογιζει ποσες φορες εμγανίζεται η κάθε αεροπορικη
max(table(z)) #το μέγιστο είναι 58 φορές
which.max(table(z))#βρισκεται στη θέση 10, δηλ η MQ
#Συνεπώς, η εταιρία MQ (American Eagle) είχε το μεγαλύτερο πλήθος κωδικών ακύρωσης τύπου Β.


#οκ#Ερώτηση 5: να βρείτε τους κωδικούς των πτήσεων με τον μεγαλύτερο αριθμό καθυστερήσεων

#καθυστέρηση θεωρείται η διαφορά του προγραμματισμένου χρόνου άφιξης από τον πραγματικό
#αν είναι αρνητική δεν θεωρείται καθυστέρηση 

k<-1
z<-c()
for(i in 1:nrow(dl))
{
  if((dl[,"ArrTime"][i]-dl[,"CRSArrTime"][i])>0)
  {
    z[k]<-dl[,"FlightNum"][i]
    k<-k+1
  }
}
View(z)#οι κωδικοι που ειχαν καθυστερηση
table(z)
max(table(z)) #εμφανίζονται 5 φορές οι παρακάτω κωδικοί
which.max(table(z))#891 & 319
#Συνεπώς, οι 891 & 319 είναι οι κωδικοί των πτήσεων με τον μεγαλύτερο αριθμό καθυστερήσεων


#οκ#Ερώτηση 6: να βρείτε και να υπολογίσετε το όνομα του μεγαλύτερου σε απόσταση προορισμού με τις περισσότερες καθυστερήσεις

#θα βρω τις πτησεις που εχουν καθυστερηση (dl[,ArrDelay]>0) και θα επιλεξω τους αντιστοιχους προορισμους και αποστασεις
#επειτα θα δω ποια η max αποσταση 
#η max αποσταση σε ποιους προορισμους αντιστοιχει
#μετα για τους προορισμους με τη max αποσταση, θα βρω ποιος ειχε τη μεγαλυτερη συχνοτητα,δηλ ποιος ειχε τις περισσοτερες καθυστερησεις


k<-1
z<-c()
w<-c()
for(i in 1:nrow(dl))
{
  if(is.na(dl[,"ArrDelay"][i]) )
  {
    z[i]<-NA
    w[i]<-NA
  }
  else if (dl[,"ArrDelay"][i]>0)
  {
    z[i]<-dl[,"Dest"][i] #οι προορισμοι που εχουν καθυστερηση
    w[i]<-dl[,"Distance"][i] #η αποσταση για τις καθυστερουμενες πτησεις
  }
}
View(z) #οι γραμμες του z ειναι 1 λιγοτερη απο οτι του dl αφου η τελευταια καθυστερηση dl[,"ArrDelay"][1936758]=-5
View(w)

table(w[]==max(w,na.rm = TRUE)) #δηλ η max τιμη (μεγιστη αποσταση=4962 χλμ) εμφανιζεται 244 φορές
new<-c() 
new<-which(w[]==max(w,na.rm = TRUE)) #οι θέσεις των πτησεων που εχουν καθυστερηση με τη μεγαλυτερη αποσταση
pin<-c()
pin<-z[new[]] #οι προορισμοι των πτησεων που εχουν καθυστερηση με τη μεγαλυτερη αποσταση
Desc(pin)
table(pin) #ο "HNL" εμφανιζεται 194 φορές

#Συνεπώς, ο "HNL" είναι το όνομα του μεγαλύτερου σε απόσταση προορισμού με τις περισσότερες καθυστερήσεις.


#οκ#Ερώτηση 7: να βρείτε και να εμφανίσετε τους προορισμούς που είχαν την μεγαλύτερη καθυστέρηση (πτήσεις που εκτελέστηκαν)

z<-c()
w<-c()
for(i in 1:nrow(dl))
{
  if(is.na(dl[,"ArrDelay"][i]) )
  {
        z[i]<-NA
        w[i]<-NA
  }
  else if (dl[,"ArrDelay"][i]>0 && (dl[,"Cancelled"][i]==0))
  {
          z[i]<-dl[,"Dest"][i]
          w[i]<-dl[,"ArrDelay"][i]
  }  
}
Desc(z)

z<-na.omit(z)
w<-na.omit(w)
new<-cbind(z,w)

z<-as.factor(z)
levels(z)
dests<-c()
dests<-levels(z)
dests<-as.character(dests)
z<-as.character(z)


sm<-c()
smo<-0
for(k in 1:length(dests))
{
for(i in 1:length(z))
{
  if (z[i]==dests[k])
  {
    smo<-smo+w[i]
  }
  else 
  { }
}
  sm[k]<-smo 
}
View(sm)

max(sm)
which.max(sm)
dests[302]
#Συνεπώς,ο προορισμός που είχε τη μεγαλύτερη καθυστέρηση(82604167 λεπτα) αλλα εκτελέστηκε η πτήση ειναι ο "YUM" . 
#The airport's FAA location identifier was "YUM"

#οκ#Ερώτηση 8: να βρείτε και να εμφανίσετε το όνομα της αεροπορικής εταιρείας που είχε τις μεγαλύτερες καθυστερήσεις που οφείλονται σε καθυστερημένη άφιξη αεροσκαφών

k<-1
z<-c()
w<-c()
for(i in 1:nrow(dl))
{
   if ( dl[,"ArrDelay"][i]>0 && is.na(dl[,"ArrDelay"][i])==FALSE && is.na(dl[,"LateAircraftDelay"][i])==FALSE)
  {
    z[k]<-dl[,"LateAircraftDelay"][i]
    w[k]<-dl[,"UniqueCarrier"][i]
    k<-k+1
  }  
}
Desc(z)

new<-cbind(w,z)

w<-as.factor(w)
levels(w)
aer<-c()
aer<-levels(w)
aer<-as.character(aer)
w<-as.character(w)


sm<-c()
smo<-0
for(k in 1:length(aer))
{
  for(i in 1:length(w))
  {
    if (w[i]==aer[k])
    {
      smo <- z[i] + smo
    }
  }
  sm[k]<-smo 
}
View(sm)

max(sm)
which.max(sm)
aer[which.max(sm)]
#Συνεπώς, η "YV" είναι το όνομα της αεροπορικής εταιρείας που είχε τις μεγαλύτερες καθυστερήσεις(31557038 λεπτά) που οφείλονται σε καθυστερημένη άφιξη αεροσκαφών


#οκ#Ερώτηση 9: να υπολογίσετε πόσες ακυρώσεις πτήσεων τύπου Α σημειώθηκαν την 13η ημέρα κάθε μήνα

k<-1
w<-c()
for(i in 1:12) 
{  sm<-0
    for(j in (min(which(dl[,"Month"]==i),na.rm=TRUE)):(max(sort(which(dl[,"Month"]==i),decreasing = TRUE),na.rm=TRUE)))
       {
           if(dl[,"DayofMonth"][i]==13)
           {
             if(dl[,"CancellationCode"][i]=="A")
             {
               sm<-sm+1
             }
           }
    }
w[k]<-sm
k<-k+1
}
View(w)
#Συνεπώς, καμία ακυρωση πτήσης τύπου Α δε σημειώθηκε την 13η ημέρα κάθε μήνα



#οκ#Ερώτηση 10: υπολογίσετε και να εμφανίσετε την μέση καθυστέρηση πτήσεων που εκτελέστηκαν από την 10η μέχρι την 23 Απριλίου 2008
k<-1
z<-c()
for(i in (min(which(dl[,"Month"]==4),na.rm=TRUE)):(max(sort(which(dl[,"Month"]==4),decreasing = TRUE),na.rm=TRUE))) 
{  
  for(j in 10:23)
{
  if(dl[,"ArrDelay"][i]>0 && is.na(dl[,"ArrDelay"][i])==FALSE && dl[,"DayofMonth"][i]==j && dl[,"Cancelled"][i]==0)
  {
     z[k]<-dl[,"ArrDelay"][i]
     k<-k+1
  }
}
}
View(z)
mean(z,na.rm=TRUE)
#Συνεπώς,η μέση καθυστέρηση πτήσεων που εκτελέστηκαν από την 10η μέχρι την 23 Απριλίου 2008 είναι :
#41.29631 

#οκ#Ερώτηση 11: να υπολογίσετε και να εμφανίσετε τον μήνα που σημειώθηκε η μεγαλύτερη καθυστέρηση που οφειλόταν σε έλεγχους ασφαλείας κατά τις ώρες 06.00-14.00


#για να υπηρξε καθυστερηση λόγω ελεγχου ασφαλειας σημαινει οτι το αεροσκαφος δεν ξεκινησε
#αρα, οι ωρες 06:00-14:00 αναφερονται στις προγραμματισμενες ωρες αναχωρησης
#κι επισης πρεπει η αναχωρηση να εγινε εστω και 1 λεπτο μετα την προγραμματισμενη ωρα
#δηλ dl[,DepDelay]>1
k<-1
z<-c()
minas<-c()
for(i in 1:nrow(dl))
{
  if (dl[,"DepDelay"][i]>1 && dl[,"CRSDepTime"][i]>=600 &&  dl[,"CRSDepTime"][i]<=1400) 
  {
    z[k]<-dl[,"SecurityDelay"][i]
    minas[k]<-dl[,"Month"][i]
    k<-k+1
  }
}
View(z)
View(minas)


sm<-c()
smo<-0
for(j in 1:12)
{
  for(i in 1:length(z))
  {
    if(z[i]>0 && is.na(z[i])==FALSE)
    {
       if (minas[i]==j)
         {
           smo <- sum(z[i],na.rm=TRUE) + smo
         }
    }
  }
  sm[j]<-smo 
}
View(sm)

max(sm)
which.max(sm)

#Άρα, τον Δεκέμβριο σημειώθηκε η μεγαλύτερη καθυστέρηση(57976 λεπτά) που οφειλόταν σε έλεγχους ασφαλείας κατά τις ώρες 06.00-14.00


#ok#Ερώτηση 12: να υπολογίσετε και να εμφανίσετε ποιος κωδικός πτήσης(αριθμός πτήσης) είχε το πρώτο δεκαήμερο του Νοεμβρίου του 2008 την μεγαλύτερη προ του αναμενόμενου χρόνου άφιξη στον προορισμό της

#Για να εχει καθυστερηση προ του αναμενομενου χρονου αφιξη στον προορισμο της
#σημαινει οτι η πτηση εφτασε νωριτερα απο τον προγραμματισμενο χρονο
#δηλαδη, dl[,ArrDelay]<0

kwd<-c()
etairia<-c()
z<-c()
k<-1
for(i in (min(which(dl[,"Month"]==11),na.rm=TRUE)):(max(sort(which(dl[,"Month"]==11),decreasing = TRUE),na.rm=TRUE)))
{
  if(dl[,"ArrDelay"][i]<0 && is.na(dl[,"ArrDelay"][i])==FALSE && dl[,"DayofMonth"][i]>=1 &&  dl[,"DayofMonth"][i]<=10)
  {
    z[k]<-dl[,"ArrDelay"][i]
    kwd[k]<-dl[,"FlightNum"][i]
    etairia[k]<-dl[,"UniqueCarrier"][i]
    k<-k+1
  }
}
View(z)
View(kwd)
View(etairia)

max(abs(z))
which.max(abs(z))
kwd[which.max(abs(z))]
etairia[which.max(abs(z))]

#Άρα,o κωδικός πτήσης  "DL 95" είχε το πρώτο δεκαήμερο του Νοεμβρίου του 2008 την μεγαλύτερη προ του αναμενόμενου χρόνου άφιξη στον προορισμό τη



#Ερώτηση 13: να υπολογίσετε και να εμφανίσετε ποιο αεροδρόμιο (τοποθεσία αναχώρησης) είχε το δεύτερο δεκαήμερο του Αυγούστου 2018 τις περισσότερες πτήσεις με καθυστέρηση(αναχωρίσεων) μεγαλύτερη από μισή ώρα που οφείλονται στους αερομεταφορείς

#θελουμε απο 11/08 έως 20/08
#για να υπαρχει καθυστερηση αναχωρησης πρεπει: dl[,"DepDelay"][i]>1
#και καθυστέρηση(αναχωρίσεων) μεγαλύτερη από μισή ώρα που οφείλονται στους αερομεταφορείς
#δηλαδη dl[,"CarrierDelay"][i]>30

z<-c()
proel<-c()
k<-1
for(i in (min(which(dl[,"Month"]==8),na.rm=TRUE)):(max(sort(which(dl[,"Month"]==8),decreasing = TRUE),na.rm=TRUE)))
{
  if(dl[,"DepDelay"][i]>1 && is.na(dl[,"DepDelay"][i])==FALSE && dl[,"CarrierDelay"][i]>30 && is.na(dl[,"CarrierDelay"][i])==FALSE && dl[,"DayofMonth"][i]>=11 &&  dl[,"DayofMonth"][i]<=20)
  {
    z[k]<-dl[,"CarrierDelay"][i]
    proel[k]<-dl[,"Origin"][i]
    k<-k+1
  }
}
View(z)
View(proel)

table(proel)
max(table(proel))
which.max(table(proel))
#Συνεπώς, το "ATL" αεροδρόμιο είχε το δεύτερο δεκαήμερο του Αυγούστου 2018 τις 
#περισσότερες (598 πτήσεις) πτήσεις με καθυστέρηση(αναχωρίσεων) μεγαλύτερη από μισή ώρα που οφείλονται στους αερομεταφορείς


#Ερώτηση 14: να βρείτε και να εμφανίσετε τις πτήσεις που εκτράπηκαν από την πορεία τους αλλά ολοκληρώθηκαν καθώς και τον συνολικό χρόνο που απαιτήθηκε

Desc(dl[,"Diverted"])#το dl[,"Diverted"]=1 υπάρχει 7.754
Desc(dl[,"Cancelled"])#το dl[,"Cancelled"]=0 υπάρχει 1.936.125
k<-1
pthsh<-c()
aerosk<-c()
ar<-c()
xronos<-c()
for(i in 1:nrow(dl))
{
  if (dl[,"Diverted"][i]==1 && dl[,"Cancelled"][i]==0 && dl[,"ActualElapsedTime"][i]>0 && is.na(dl[,"ActualElapsedTime"][i])==FALSE)
  {
         aerosk[k]<-dl[,"TailNum"][i]
         pthsh[k]<-dl[,"FlightNum"][i]
         ar[k]<-dl[,"FlightNum"][i]
         xronos[k]<-dl[,"ActualElapsedTime"][i]
         k<-k+1
  }
}
View(pthsh)
View(ar)
View(xronos)
View(aerosk)
#Συνεπώς δεν υπάρχουν πτήσεις που εκτράπηκαν από την πορεία τους αλλά ολοκληρώθηκαν.


#ok#Ερώτηση 15: ποιος μήνας είχε την μεγαλύτερη τυπική απόκλιση σε καθυστερήσεις ("πιο απρόβλεπτος μήνας"). Ως απόκλιση να θεωρηθεί η διαφορά ανάμεσα στον προγραμματισμένο και τον πραγματικό χρόνο εκτέλεσης της πτήσης

k<-1
w<-c()#αποθηκευω για καθε μήνα την τυπικη αποκλιση (sd) των καθιστερησεων
for(i in 1:12) #για καθε μηνα βρισκω την Απόκλιση καθυστερησης και την αποθηκευω στη z
{  z=c()
    for(j in (min(which(dl[,"Month"]==i),na.rm=TRUE)):(max(sort(which(dl[,"Month"]==i),decreasing = TRUE),na.rm=TRUE)))
      #τα j τρεχουν απο την min θεση του i-μηνα έως την max θεση του i-μηνα
      {
         z[j]<-abs(dl[,"ActualElapsedTime"][j]-dl[,"CRSElapsedTime"][j])
       }
w[k]<-sd(z,na.rm = TRUE) #για τον k-μηνα, η τυπ.αποκλιση είναι: w[k]
k<-k+1
}
View(w)
max(w) #βρισκω πόσο ειναι η μεγιστη τυπ.απόκλιση
which.max(w)#σε ποια θέση (μήνα) βρισκεται
## Συνεπώς, ο μήνας με τη max τυπικη απόκλιση καθηστερησεων, ειναι ο μήνας 7ος = Ιούλιος.








#Τρόπος υποβολής εργασίας:αποστολή email στο smos@uom.edu.gr με το όνομα του github repository από το github
#όπου έχετε ανεβάσει το παραπάνω αρχείο με συμπληρωμένες τις αντίστοιχες ενότητες των απαντήσεων
